Catalogs/СообщенияРЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СообщенияРЭМД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обновить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПоследнейОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрируемыеЭлектронныеМедДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРЭМД</Name>
					<Comment>emdrId</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторШаблонаЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транспорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереотправок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВПроцессеРегистрации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлектронныеПодписиЭМД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлуПодписиЭМД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольРЭМД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПриПодписиМедДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПодписьМО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД_ЭЦП</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностьМинздрава</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпециальностьМинздрава</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Версии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлуЭМД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СостоянияСообщенийРЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияСообщенийРЭМД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрированные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтправке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОшибками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодписаныМО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПолученОтвет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СообщенияРЭМД/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Состояние") Тогда
		
		НачалоДня = Дата(1,1,1);
		ВыбранныйФилиал = Неопределено;
		
		Если Параметры.Свойство("ЗаСегодня") И Параметры.ЗаСегодня Тогда
			НачалоДня = НачалоДня(ТекущаяДатаСеанса());
		КонецЕсли;
		
		Если Параметры.Свойство("Филиал") Тогда
			ВыбранныйФилиал = Параметры.Филиал;
		КонецЕсли;
		
		ИзменитьТекстЗапроса(Параметры.Состояние, НачалоДня, ВыбранныйФилиал);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПометитьНаОтправку(Команда)
	
	ВыделеноОдно = Элементы.Список.ВыделенныеСтроки.Количество() = 1;
	ЕстьЗарегистрированныеСообщения = ЕстьЗарегистрированныеСообщенияИзПомеченныхКОтправке();
	
	Если ЕстьЗарегистрированныеСообщения Тогда
		Если ВыделеноОдно Тогда 
			Оповещение = Новый ОписаниеОповещения("УстановкаОтметкиОтправитьОдноЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, НСтр("ru='Сообщение уже зарегистрировано в РЭМД. Пометить на отправку?'"), РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Иначе
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить(КодВозвратаДиалога.Да, "Пометить все");
			Кнопки.Добавить(КодВозвратаДиалога.Нет, "Пометить незарегистрированные");
			Кнопки.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
			Оповещение = Новый ОписаниеОповещения("УстановкаОтметкиОтправитьНесколькоЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, НСтр("ru='Среди сообщений есть уже зарегистрированные в РЭМД'"), Кнопки,, КодВозвратаДиалога.Нет);
		КонецЕсли;
	Иначе
		ПометитьНаОтправкуНаСервере(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКОтправке(Команда)
	ОткрытьФорму("ОбщаяФорма.АРМПодписанияМедицинскойДокументации");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьТекстЗапроса(Состояние, НачалоДня, ВыбранныйФилиал)
	
	НовыйТекстЗапроса =
		"ВЫБРАТЬ
		|	СообщенияРЭМД.Ссылка КАК Ссылка,
		|	СообщенияРЭМД.ПометкаУдаления КАК ПометкаУдаления,
		|	СообщенияРЭМД.Код КАК Код,
		|	СообщенияРЭМД.Наименование КАК Наименование,
		|	СообщенияРЭМД.Документ КАК Документ,
		|	СообщенияРЭМД.Клиент КАК Клиент,
		|	СообщенияРЭМД.ДатаСоздания КАК ДатаСоздания,
		|	СообщенияРЭМД.ПутьКФайлуЭМД КАК ПутьКФайлуЭМД,
		|	СообщенияРЭМД.Отправить КАК Отправить,
		|	СообщенияРЭМД.Обновить КАК Обновить,
		|	СообщенияРЭМД.НомерДокумента КАК НомерДокумента,
		|	СообщенияРЭМД.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	СообщенияРЭМД.ТекстПоследнейОшибки КАК ТекстПоследнейОшибки,
		|	СообщенияРЭМД.ВидДокумента КАК ВидДокумента,
		|	СообщенияРЭМД.НомерВерсии КАК НомерВерсии,
		|	СообщенияРЭМД.ИдентификаторРЭМД КАК ИдентификаторРЭМД,
		|	СообщенияРЭМД.ХранитьДо КАК ХранитьДо,
		|	СообщенияРЭМД.ИдентификаторШаблонаЭМД КАК ИдентификаторШаблонаЭМД,
		|	СообщенияРЭМД.Предопределенный КАК Предопределенный,
		|	СообщенияРЭМД.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|	СообщенияРЭМД.Документ.Филиал КАК Филиал
		|ИЗ
		|	Справочник.СообщенияРЭМД КАК СообщенияРЭМД
		|ГДЕ
		|	СообщенияРЭМД.Ссылка В
		|			(ВЫБРАТЬ
		|				СообщенияРЭМД.Ссылка
		|			ИЗ
		|				СообщенияПоСостоянию КАК СообщенияРЭМД)";
	
	ТекстыЗапросов = ПолучитьТекстыЗапросовПоСостояниям();
	
	ЧастиТекстаЗапроса = Новый Массив;
	ЧастиТекстаЗапроса.Добавить(ТекстыЗапросов.Получить(Состояние));
	ЧастиТекстаЗапроса.Добавить(НовыйТекстЗапроса);
	
	Список.ТекстЗапроса = СтрСоединить(ЧастиТекстаЗапроса, ";" + Символы.ПС);
	Список.Параметры.УстановитьЗначениеПараметра("НачалоДня", НачалоДня);
	Список.Параметры.УстановитьЗначениеПараметра("ПоВыбранномуФилиалу", ВыбранныйФилиал <> Неопределено);
	Список.Параметры.УстановитьЗначениеПараметра("ВыбранныйФилиал", ВыбранныйФилиал);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстыЗапросовПоСостояниям()
	
	ИмяВТ = "СообщенияПоСостоянию";
	
	Тексты = Новый Соответствие;
	Тексты.Вставить(Перечисления.СостоянияСообщенийРЭМД.Зарегистрированные,	ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаВТСообщенияЗарегистрированные(ИмяВТ));
	Тексты.Вставить(Перечисления.СостоянияСообщенийРЭМД.КОтправке,			ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаВТСообщенияКОтправке(ИмяВТ));
	Тексты.Вставить(Перечисления.СостоянияСообщенийРЭМД.СОшибками,			ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаВТСообщенияСОшибками(ИмяВТ));
	Тексты.Вставить(Перечисления.СостоянияСообщенийРЭМД.НеПодписаныМО,		ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаВТСообщенияНеПодписаныМО(ИмяВТ));
	Тексты.Вставить(Перечисления.СостоянияСообщенийРЭМД.НеПолученОтвет,		ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаВТСообщенияНеПолученОтвет(ИмяВТ));
	
	Возврат Тексты;
	
КонецФункции

&НаСервере
Функция ЕстьЗарегистрированныеСообщенияИзПомеченныхКОтправке()
	
	Для Каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		Если ЗначениеЗаполнено(СтрокаСписка.Ссылка) И ЗначениеЗаполнено(СтрокаСписка.Ссылка.ИдентификаторРЭМД) Тогда
			Возврат Истина
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ПометитьНаОтправкуНаСервере(ПомечатьЗарегистрированные)
	
	Для Каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		Если ЗначениеЗаполнено(СтрокаСписка.Ссылка) Тогда
			Если Не ПомечатьЗарегистрированные
				И ЗначениеЗаполнено(СтрокаСписка.Ссылка.ИдентификаторРЭМД)
				Или СтрокаСписка.Ссылка.ВПроцессеРегистрации
			Тогда
				Продолжить;
			КонецЕсли;
			
			СообщениеОбъект = СтрокаСписка.Ссылка.ПолучитьОбъект();
			СообщениеОбъект.Отправить = Истина;
			Попытка
				СообщениеОбъект.Записать();
			Исключение КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтметкиОтправитьОдноЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПометитьНаОтправкуНаСервере(Истина);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтметкиОтправитьНесколькоЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПометитьНаОтправкуНаСервере(Истина);
		Элементы.Список.Обновить();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ПометитьНаОтправкуНаСервере(Ложь);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
